Core/src/Catalogs/Адреса/Адреса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Адреса</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Страна</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Улица</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дом</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корпус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КварираОфис</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеАдреса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Core/src/Catalogs/Адреса/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Объект.Страна = справочники.СтраныМира.НайтиПоКоду("GEO");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантВводаАдресаПриИзменении(Элемент)
	
	Если ВариантВводаАдреса = "" Тогда 
		Элементы.ГруппаПомошник.Видимость = Истина;
		Элементы.Наименование.Доступность = ЛОЖЬ;
	Иначе
		Элементы.ГруппаПомошник.Видимость = ЛОЖЬ;
		Элементы.Наименование.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЧастьАдресаПриИзменении(Элемент)
	
	Объект.Наименование =
	?(ЗначениеЗаполнено(Объект.Страна), Строка(Объект.Страна) + ", ", "")
	+ ?(ЗначениеЗаполнено(Объект.Город), Объект.Город + ", ", "")
	+ ?(ЗначениеЗаполнено(Объект.Улица), Объект.Улица + " ", "")
	+ ?(ЗначениеЗаполнено(Объект.Дом), Объект.Дом, "")
	+ ?(ЗначениеЗаполнено(Объект.Корпус), Объект.Корпус + ", ", "")
	+ ?(ЗначениеЗаполнено(Объект.КварираОфис), Объект.КварираОфис, "");
	
КонецПроцедуры
